In [1]:
import pandas as pd
import numpy as np

In [14]:
import matplotlib.pyplot as plt
import seaborn as sns

In [7]:
result = -484

In [8]:
x, y = list(map(int, input().split()))

5 3

In [9]:
data = []

In [11]:
for _ in range(x):
    data.append(list(map(float, input().split())))

-1.7 -0.17 1.2
0.5 -0.01 2.1
0.5 -1.6 -0.9
-0.3 -0.0 -1.2
-0.7 0.5 2.2

In [78]:
data

[[-1.7, -0.17, 1.2],
 [0.5, -0.01, 2.1],
 [0.5, -1.6, -0.9],
 [-0.3, -0.0, -1.2],
 [-0.7, 0.5, 2.2]]

In [79]:
df = pd.DataFrame(data)

In [80]:
df

     0     1    2
0 -1.7 -0.17  1.2
1  0.5 -0.01  2.1
2  0.5 -1.60 -0.9
3 -0.3 -0.00 -1.2
4 -0.7  0.50  2.2

In [81]:
df.columns = ['No. 1','No. 2','No. 3']
df

   No. 1  No. 2  No. 3
0   -1.7  -0.17    1.2
1    0.5  -0.01    2.1
2    0.5  -1.60   -0.9
3   -0.3  -0.00   -1.2
4   -0.7   0.50    2.2

In [83]:
cor_matrix = df.corr(method='pearson')

In [84]:
cor_matrix

          No. 1     No. 2     No. 3
No. 1  1.000000 -0.445826 -0.243830
No. 2 -0.445826  1.000000  0.616577
No. 3 -0.243830  0.616577  1.000000

In [85]:
np.fill_diagonal(cor_matrix.values, 0)

In [87]:
cor_matrix

          No. 1     No. 2     No. 3
No. 1  0.000000 -0.445826 -0.243830
No. 2 -0.445826  0.000000  0.616577
No. 3 -0.243830  0.616577  0.000000

In [33]:
#upper_tri = cor_matrix.where(np.triu(np.ones(cor_matrix.shape),k=1).astype(np.bool))

C:\Users\yawi1\AppData\Local\Temp/ipykernel_1744/3673341754.py:1: DeprecationWarning: `np.bool` is a deprecated alias for the builtin `bool`. To silence this warning, use `bool` by itself. Doing this will not modify any behavior and is safe. If you specifically wanted the numpy scalar type, use `np.bool_` here.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  upper_tri = cor_matrix.where(np.triu(np.ones(cor_matrix.shape),k=1).astype(np.bool))

In [34]:
#upper_tri

       No. 1     No. 2     No. 3
No. 1    NaN -0.445826 -0.243830
No. 2    NaN       NaN  0.616577
No. 3    NaN       NaN       NaN

In [42]:
sorted_mat = upper_tri.unstack().sort_values(ascending = False)

In [43]:
sorted_mat

No. 3  No. 2    0.616577
       No. 1   -0.243830
No. 2  No. 1   -0.445826
No. 1  No. 1         NaN
       No. 2         NaN
       No. 3         NaN
No. 2  No. 2         NaN
       No. 3         NaN
No. 3  No. 3         NaN
dtype: float64

In [94]:
max_col = [column for column in cor_matrix.columns if any(cor_matrix[column]==max(sorted_mat))]

In [95]:
max_col

['No. 2', 'No. 3']

In [112]:
df['New']=df[max_col[0]]*df[max_col[1]]

In [118]:
df

   No. 1  No. 2  No. 3    New
0   -1.7  -0.17    1.2 -0.204
1    0.5  -0.01    2.1 -0.021
2    0.5  -1.60   -0.9  1.440
3   -0.3  -0.00   -1.2  0.000
4   -0.7   0.50    2.2  1.100

In [119]:
df.drop(max_col, inplace=True, axis=1)

In [120]:
df

   No. 1    New
0   -1.7 -0.204
1    0.5 -0.021
2    0.5  1.440
3   -0.3  0.000
4   -0.7  1.100

In [123]:
round(df.mean(axis=1),2)

0   -0.95
1    0.24
2    0.97
3   -0.15
4    0.20
dtype: float64

In [ ]:
df